#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_backend_service.backend_service will be created
  + resource "google_compute_backend_service" "backend_service" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + description                     = "Backend service contianing the Managed Instance Group"
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "assignment-terraform-dev-backend-service"
      + port_name                       = "http"
      + project                         = (known after apply)
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = 10

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }
      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
        }

      + cdn_policy {
          + cache_mode                   = (known after apply)
          + client_ttl                   = (known after apply)
          + default_ttl                  = (known after apply)
          + max_ttl                      = (known after apply)
          + negative_caching             = (known after apply)
          + serve_while_stale            = (known after apply)
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_named_cookies  = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }

          + negative_caching_policy {
              + code = (known after apply)
              + ttl  = (known after apply)
            }
        }

      + log_config {
          + enable      = (known after apply)
          + sample_rate = (known after apply)
        }
    }

  # google_compute_firewall.allow_health_check will be created
  + resource "google_compute_firewall" "allow_health_check" {
      + creation_timestamp = (known after apply)
      + description        = "Firewall to allow health checks on the MIG instances"
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "assignment-terraform-dev-health-check-firewall"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "130.211.0.0/22",
          + "35.191.0.0/16",
        ]
      + target_tags        = [
          + "allow-health-check",
        ]

      + allow {
          + ports    = [
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_global_address.global-address will be created
  + resource "google_compute_global_address" "global-address" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + description        = "Public IP address of the load balancer"
      + id                 = (known after apply)
      + name               = "assignment-terraform-dev-global-address"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_global_forwarding_rule.forwarding-rule will be created
  + resource "google_compute_global_forwarding_rule" "forwarding-rule" {
      + description           = "Global external load balancer"
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "assignment-terraform-dev-forwarding-rule-port-8080"
      + network               = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_health_check.autohealing will be created
  + resource "google_compute_health_check" "autohealing" {
      + check_interval_sec  = 10
      + creation_timestamp  = (known after apply)
      + description         = "Autohealing http health check for the managed instance group"
      + healthy_threshold   = 1
      + id                  = (known after apply)
      + name                = "assignment-terraform-dev-autohealing-health-check"
      + project             = (known after apply)
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + type                = (known after apply)
      + unhealthy_threshold = 3

      + http_health_check {
          + port         = 80
          + proxy_header = "NONE"
          + request_path = "/"
        }

      + log_config {
          + enable = (known after apply)
        }
    }

  # google_compute_instance_template.web_server will be created
  + resource "google_compute_instance_template" "web_server" {
      + can_ip_forward          = false
      + description             = "This template is used to create a apache2 web server"
      + id                      = (known after apply)
      + instance_description    = "Instance running a apache2 web server"
      + labels                  = {
          + "environment" = "dev"
        }
      + machine_type            = "e2-standard-2"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
                #!/bin/bash
                apt update 
                apt -y install apache2
                echo "Hello world from $(hostname) $(hostname -I)" > /var/www/html/index.html
        EOT
      + name                    = (known after apply)
      + name_prefix             = (known after apply)
      + project                 = (known after apply)
      + region                  = (known after apply)
      + self_link               = (known after apply)
      + tags                    = [
          + "allow-health-check",
        ]
      + tags_fingerprint        = (known after apply)

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + disk {
          + auto_delete  = true
          + boot         = (known after apply)
          + device_name  = (known after apply)
          + disk_size_gb = (known after apply)
          + disk_type    = (known after apply)
          + interface    = (known after apply)
          + mode         = (known after apply)
          + source_image = "debian-cloud/debian-11"
          + type         = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute.readonly",
            ]
        }
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + description                     = "Virtual private network for the application"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "assignment-terraform-dev-vpc"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_region_instance_group_manager.web_server_instance_group["europe-west4"] will be created
  + resource "google_compute_region_instance_group_manager" "web_server_instance_group" {
      + base_instance_name               = "assignment-terraform-dev-nginx"
      + description                      = "Managed instance group in a region distributed over multiple zones"
      + distribution_policy_target_shape = (known after apply)
      + distribution_policy_zones        = [
          + "europe-west4-a",
          + "europe-west4-b",
          + "europe-west4-c",
        ]
      + fingerprint                      = (known after apply)
      + id                               = (known after apply)
      + instance_group                   = (known after apply)
      + name                             = (known after apply)
      + project                          = (known after apply)
      + region                           = "europe-west4"
      + self_link                        = (known after apply)
      + status                           = (known after apply)
      + target_size                      = 3
      + wait_for_instances               = false
      + wait_for_instances_status        = "STABLE"

      + auto_healing_policies {
          + health_check      = (known after apply)
          + initial_delay_sec = 30
        }

      + named_port {
          + name = "http"
          + port = 80
        }

      + update_policy {
          + instance_redistribution_type   = (known after apply)
          + max_surge_fixed                = (known after apply)
          + max_surge_percent              = (known after apply)
          + max_unavailable_fixed          = (known after apply)
          + max_unavailable_percent        = (known after apply)
          + minimal_action                 = (known after apply)
          + most_disruptive_allowed_action = (known after apply)
          + replacement_method             = (known after apply)
          + type                           = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_region_instance_group_manager.web_server_instance_group["us-central1"] will be created
  + resource "google_compute_region_instance_group_manager" "web_server_instance_group" {
      + base_instance_name               = "assignment-terraform-dev-nginx"
      + description                      = "Managed instance group in a region distributed over multiple zones"
      + distribution_policy_target_shape = (known after apply)
      + distribution_policy_zones        = [
          + "us-central1-a",
          + "us-central1-b",
          + "us-central1-c",
        ]
      + fingerprint                      = (known after apply)
      + id                               = (known after apply)
      + instance_group                   = (known after apply)
      + name                             = (known after apply)
      + project                          = (known after apply)
      + region                           = "us-central1"
      + self_link                        = (known after apply)
      + status                           = (known after apply)
      + target_size                      = 3
      + wait_for_instances               = false
      + wait_for_instances_status        = "STABLE"

      + auto_healing_policies {
          + health_check      = (known after apply)
          + initial_delay_sec = 30
        }

      + named_port {
          + name = "http"
          + port = 80
        }

      + update_policy {
          + instance_redistribution_type   = (known after apply)
          + max_surge_fixed                = (known after apply)
          + max_surge_percent              = (known after apply)
          + max_unavailable_fixed          = (known after apply)
          + max_unavailable_percent        = (known after apply)
          + minimal_action                 = (known after apply)
          + most_disruptive_allowed_action = (known after apply)
          + replacement_method             = (known after apply)
          + type                           = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_router.router["europe-west4"] will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + description        = "Network router for each region in the VPC"
      + id                 = (known after apply)
      + name               = "assignment-terraform-dev-router"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = "europe-west4"
      + self_link          = (known after apply)
    }

  # google_compute_router.router["us-central1"] will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + description        = "Network router for each region in the VPC"
      + id                 = (known after apply)
      + name               = "assignment-terraform-dev-router"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = "us-central1"
      + self_link          = (known after apply)
    }

  # google_compute_router_nat.nat["europe-west4"] will be created
  + resource "google_compute_router_nat" "nat" {
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = true
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + name                                = "assignment-terraform-dev-nat"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = (known after apply)
      + region                              = "europe-west4"
      + router                              = "assignment-terraform-dev-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30
    }

  # google_compute_router_nat.nat["us-central1"] will be created
  + resource "google_compute_router_nat" "nat" {
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = true
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + name                                = "assignment-terraform-dev-nat"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = (known after apply)
      + region                              = "us-central1"
      + router                              = "assignment-terraform-dev-router"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30
    }

  # google_compute_subnetwork.vpc_subnet["europe-west4"] will be created
  + resource "google_compute_subnetwork" "vpc_subnet" {
      + creation_timestamp         = (known after apply)
      + description                = "Subent for each region in the VPC"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "172.16.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "assignment-terraform-dev-subnet-europe-west4"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "europe-west4"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # google_compute_subnetwork.vpc_subnet["us-central1"] will be created
  + resource "google_compute_subnetwork" "vpc_subnet" {
      + creation_timestamp         = (known after apply)
      + description                = "Subent for each region in the VPC"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "172.16.1.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "assignment-terraform-dev-subnet-us-central1"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # google_compute_target_http_proxy.webserver_proxy will be created
  + resource "google_compute_target_http_proxy" "webserver_proxy" {
      + creation_timestamp = (known after apply)
      + description        = "Proxy mapping for the Load balancer"
      + id                 = (known after apply)
      + name               = "assignment-terraform-dev-webserver-proxy"
      + project            = (known after apply)
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # google_compute_url_map.url_map will be created
  + resource "google_compute_url_map" "url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + description        = "Url mapping to the backend services"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "assignment-terraform-dev-url-map"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # google_project_iam_binding.mig_roles["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_binding" "mig_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "playground-daan"
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_service_account.instance_service_account will be created
  + resource "google_service_account" "instance_service_account" {
      + account_id   = "assignment-terraform-dev-mig"
      + description  = "Service account attached to the MIG instances"
      + disabled     = false
      + display_name = "Service Account used for the managed instance groups"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "playground-daan"
      + unique_id    = (known after apply)
    }

  # random_id.instance_template_suffix will be created
  + resource "random_id" "instance_template_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 6
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @DanielRieske, Action: `pull_request`*